z2akhtar-zz/PWC-Demonstrator/AUTOSAR/core/arch/ppc/mpc55xx/drivers/PwmFlex.c
/*-------------------------------- Arctic Core ------------------------------
 * Copyright (C) 2013, ArcCore AB, Sweden, www.arccore.com.
 * Contact: <contact@arccore.com>
 * 
 * You may ONLY use this file:
 * 1)if you have a valid commercial ArcCore license and then in accordance with  
 * the terms contained in the written license agreement between you and ArcCore, 
 * or alternatively
 * 2)if you follow the terms found in GNU General Public License version 2 as 
 * published by the Free Software Foundation and appearing in the file 
 * LICENSE.GPL included in the packaging of this file or here 
 * <http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt>
 *-------------------------------- Arctic Core -----------------------------*/

/** @tagSettings DEFAULT_ARCHITECTURE=NOT_USED */
/** @reqSettings DEFAULT_SPECIFICATION_REVISION=4.1.2 */

/* NOTES
 * The PWMX is bound with submodule period. The PWM signals are generated in the following manner.
- The INIT and VAL1 registers define the PWM modulo/period. So the PWM counter counts from INIT to VAL1 and then reinit to INIT again etc.
- The VAL2 resp. VAL3 define the compare value when PWMA goes High resp. Low.
- The VAL4 resp. VAL5 define the compare value when PWMB goes High resp. Low.
- The VAL0 defines half cycle reload point and also define the time when PWMX signal is set and the local sync signal is reset.
- The VAL1 also causes PWMX reseting and asserting local sync.
So the usage of PMWA and PWMB signals is easy. The PWMX, if not use as input (for capture feature etc), can generate also the PWM signal but you have to take into account that it represents the local sync signal, which is usually selected as sync source by INIT_SEL bits of CTRL2.
 *
 */


#include <assert.h>
#include <string.h>

#include "Pwm.h"
#include "MemMap.h"
#if defined(USE_DET)
#include "Det.h"
#endif
#include "mpc55xx.h"

#include "Os.h"
#include "Mcu.h"
#if (PWM_NOTIFICATION_SUPPORTED==STD_ON)
#include "isr.h"
#include "irq.h"
#include "arc.h"
#endif
static volatile struct FLEXPWM_tag * const PLEXPWM[] = {&FLEXPWM_0, &FLEXPWM_1};
#define GET_FLEXPWM_HW(_index) PLEXPWM[(_index) / PWM_CHANNELS_PER_MODULE]
#define GET_SUBMODULE(_index) ((_index) % PWM_CHANNELS_PER_MODULE / FLEXPWM_SUB_MODULE_DIVIDER)
#define PWM_CHANNELS_PER_MODULE (sizeof(FLEXPWM_0.SUB)/sizeof(FLEXPWM_0.SUB[0])*FLEXPWM_SUB_MODULE_DIVIDER)
#define GET_SUB_START_CHANNEL(_hw, _sub) ((_hw)*PWM_CHANNELS_PER_MODULE) + ((_sub)*FLEXPWM_SUB_MODULE_DIVIDER)
#define IS_VALID_CHANNEL(_x) ((_x) < PWM_NUMBER_OF_CHANNELS)

#define FLEXPWM_SUB_MODULE_DIVIDER 3

#define PWM_PERIOD_MAX_TICKS 0x7FFE
#define GET_HW_PTR(_hwUnit) PLEXPWM[(_hwUnit)]

#if ( PWM_DEV_ERROR_DETECT == STD_ON )
#define VALIDATE(_exp,_api,_err ) \
        if( !(_exp) ) { \
          Det_ReportError(PWM_MODULE_ID,0,_api,_err); \
          return; \
        }

#define VALIDATE_W_RV(_exp,_api,_err,_rv ) \
        if( !(_exp) ) { \
          Det_ReportError(PWM_MODULE_ID,0,_api,_err); \
          return (_rv); \
        }
#else
#define VALIDATE(_exp,_api,_err )
#define VALIDATE_W_RV(_exp,_api,_err,_rv )
#endif


const Pwm_ConfigType* PwmConfigPtr = NULL;

typedef enum {
	PWM_STATE_UNINITIALIZED, PWM_STATE_INITIALIZED
} Pwm_ModuleStateType;
typedef enum {
    PWM_A, PWM_B, PWM_X
} PwmT;

#if (PWM_NOTIFICATION_SUPPORTED==STD_ON)
typedef struct {
    Pwm_EdgeNotificationType EdgeNotification;
    boolean Locked;
}EdgeNotificationStatusType;
#endif

typedef struct {
    Pwm_ModuleStateType ModuleState;
#if (PWM_NOTIFICATION_SUPPORTED==STD_ON)
    EdgeNotificationStatusType ChannelEdgeNotification[PWM_NUMBER_OF_CHANNELS];
#endif
}PwmInternalType;

static PwmInternalType PwmInternal = {
        .ModuleState = PWM_STATE_UNINITIALIZED,
};
typedef struct {
    uint8 dutyRegIndex;
    uint8 periodRegIndex;
}PwmRegIndexType;

static const PwmRegIndexType PwmRegIndex[FLEXPWM_SUB_MODULE_DIVIDER] = {
        [PWM_A] = {
                .dutyRegIndex = 3, /* VAL[3] */
                .periodRegIndex = 1, /* VAL[1] */
        },
        [PWM_B] = {
                .dutyRegIndex = 5, /* VAL[5] */
                .periodRegIndex = 1, /* VAL[1] */
        },
        [PWM_X] = {
                .dutyRegIndex = 0, /* VAL[0] */
                .periodRegIndex = 1, /* VAL[1] */
        },
};

static void SetDutyCycle(Pwm_ChannelType Channel, uint16 DutyCycle);

#if (PWM_NOTIFICATION_SUPPORTED == STD_ON)
static void Pwm_Isr(uint8 hwUnit, uint8 sub);
#if defined(NOTIFICATION_ON_CHANNEL_0_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_1_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_2_ENABLED)
ISR(Pwm_Isr_0_0){Pwm_Isr(0,0);}
#endif
#if defined(NOTIFICATION_ON_CHANNEL_3_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_4_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_5_ENABLED)
ISR(Pwm_Isr_0_1){Pwm_Isr(0,1);}
#endif
#if defined(NOTIFICATION_ON_CHANNEL_6_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_7_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_8_ENABLED)
ISR(Pwm_Isr_0_2){Pwm_Isr(0,2);}
#endif
#if defined(NOTIFICATION_ON_CHANNEL_9_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_10_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_11_ENABLED)
ISR(Pwm_Isr_0_3){Pwm_Isr(0,3);}
#endif
#if defined(NOTIFICATION_ON_CHANNEL_12_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_13_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_14_ENABLED)
ISR(Pwm_Isr_1_0){Pwm_Isr(1,0);}
#endif
#if defined(NOTIFICATION_ON_CHANNEL_15_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_16_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_17_ENABLED)
ISR(Pwm_Isr_1_1){Pwm_Isr(1,1);}
#endif
#if defined(NOTIFICATION_ON_CHANNEL_18_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_19_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_20_ENABLED)
ISR(Pwm_Isr_1_2){Pwm_Isr(1,2);}
#endif
#if defined(NOTIFICATION_ON_CHANNEL_21_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_22_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_23_ENABLED)
ISR(Pwm_Isr_1_3){Pwm_Isr(1,3);}
#endif
#endif

static void calcPeriodTicksAndPrescaler(
				const Pwm_ChannelConfigurationType* channelConfig,
				uint16_t* ticks, Pwm_ChannelPrescalerType* prescaler) {

	uint32_t f_in = 0;

	f_in = Mcu_Arc_GetPeripheralClock( PERIPHERAL_CLOCK_FLEXPWM_0 );

	uint32_t f_target = channelConfig->frequency;

