z2akhtar-zz/PWC-Demonstrator/AUTOSAR/core/arch/ppc/mpc55xx/drivers/PwmFlex.c
	Pwm_ChannelPrescalerType pre;
	uint32_t ticks_temp;

	if (channelConfig->prescaler == PWM_CHANNEL_PRESCALER_DIV_AUTO) {
		// Go from lowest to highest prescaler
		for (pre = PWM_CHANNEL_PRESCALER_DIV_1; pre <= PWM_CHANNEL_PRESCALER_DIV_128; pre++) {
            ticks_temp = f_in / (f_target * (1 << pre)); // Calc ticks
		  if (ticks_temp > PWM_PERIOD_MAX_TICKS) {
			ticks_temp = PWM_PERIOD_MAX_TICKS;  // Prescaler too low
            } else {
                break;                // Prescaler ok
            }
		}
	} else {
		pre = channelConfig->prescaler; // Use config setting
		ticks_temp = f_in / (f_target * (1 << pre)); // Calc ticks
		if (ticks_temp > PWM_PERIOD_MAX_TICKS) {
		  ticks_temp = PWM_PERIOD_MAX_TICKS;  // Prescaler too low
		}
		}

	(*ticks) = (uint16_t) ticks_temp;
	(*prescaler) = pre;
}


static void configureChannel(Pwm_ChannelType Channel){

    const Pwm_ChannelConfigurationType* channelConfig = &PwmConfigPtr->Channels[Channel];
    volatile struct FLEXPWM_tag *flexHw = GET_FLEXPWM_HW(channelConfig->index);
    uint8 sub = GET_SUBMODULE(channelConfig->index);
    PwmT pwm =  (PwmT)(channelConfig->index % FLEXPWM_SUB_MODULE_DIVIDER);
	Pwm_ChannelPrescalerType prescaler;
	uint16_t period_ticks;

	/*  Remove submodule unique so that it is not configured for all channels */

	/* All channels on same submodule must have same period. Should be checked by validation */
	calcPeriodTicksAndPrescaler( channelConfig, &period_ticks, &prescaler );

	// clear LDOK to be able to modify register settings
    flexHw->MCTRL.B.CLDOK |= 1 << sub;

	/* Prescaler */
	flexHw->SUB[sub].CTRL.B.PRSC = prescaler;

	/* Edge aligned output, modulo count */
	flexHw->SUB[sub].INIT.R =   0x0000; /* INIT value */
	flexHw->SUB[sub].VAL[1].R = period_ticks; /* maximum count i.e. period NOTE! Valid for whole subgroup */

	flexHw->SUB[sub].DISMAP.R   = 0x0000;	/* disable fault pin condition */
	flexHw->SUB[sub].CTRL2.B.INDEP = 1; /* Run as independent channels */

	/* Polarity */
	switch(pwm)
	{
	case PWM_A: /* PWMA */
		flexHw->SUB[sub].VAL[2].R = 0x0000; /* PWMA rising edge */
		flexHw->SUB[sub].OCTRL.B.POLA = (channelConfig->polarity == PWM_LOW) ? 1 : 0;
		break;
	case PWM_B: /* PWMB */
		flexHw->SUB[sub].VAL[4].R = 0x0000; /* PWMB rising edge */
		flexHw->SUB[sub].OCTRL.B.POLB = (channelConfig->polarity == PWM_LOW) ? 1 : 0;
		break;
	case PWM_X: /* PWMX */
		flexHw->SUB[sub].VAL[0].R = 0x0000; /* PWMX rising edge */
		/* Since we can only set the rising edge for PWMX, we set the polarity
		 * in the opposite way compared to PWMA and PWMB. */
		flexHw->SUB[sub].OCTRL.B.POLX = (channelConfig->polarity == PWM_LOW) ? 0 : 1;
		break;
	}

	/* PWM009: The function Pwm_Init shall start all PWM channels with the configured
		default values. If the duty cycle parameter equals:
		􀂃 0% or 100% : Then the PWM output signal shall be in the state according to
			the configured polarity parameter
		􀂃 >0% and <100%: Then the PWM output signal shall be modulated according
		to parameters period, duty cycle and configured polarity. */
	SetDutyCycle(Channel, channelConfig->duty);
	// enable outputs when all configuration is done
    switch(pwm)
    {
    case PWM_A:
        flexHw->OUTEN.B.PWMA_EN |= 1 << sub;
        break;
    case PWM_B:
        flexHw->OUTEN.B.PWMB_EN |= 1 << sub;
        break;
    case PWM_X:
        flexHw->OUTEN.B.PWMX_EN |= 1 << sub;
        break;
    }
    flexHw->MCTRL.B.LDOK |= 1 << sub;
    flexHw->MCTRL.B.RUN |= 1 << sub;

}
#if (PWM_NOTIFICATION_SUPPORTED==STD_ON)
/**
 * Disables notifications for the channel
 * @param Channel
 */
static void disableNotification(Pwm_ChannelType Channel)
{
    uint8 disableMask = 3;
    const Pwm_ChannelConfigurationType* channelConfig = &PwmConfigPtr->Channels[Channel];
    volatile struct FLEXPWM_tag *flexHw = GET_FLEXPWM_HW(channelConfig->index);
    uint8 sub = GET_SUBMODULE(channelConfig->index);
    PwmT pwm =  (PwmT)(channelConfig->index % FLEXPWM_SUB_MODULE_DIVIDER);

    switch(pwm) {
    case PWM_A:
        disableMask <<= 2;
        break;
    case PWM_B:
        disableMask <<= 4;
        break;
    case PWM_X:
        disableMask <<= 0;
        break;
    }
    // clear eventual pending notification
    flexHw->SUB[sub].STS.B.CMPF = ~disableMask;
    /* Clear flags on this submodule */
    flexHw->SUB[sub].INTEN.B.CMPIE &= ~disableMask;


}
/**
 * Tries to disable notifications for the channel.
 * @param Channel
 */
static void tryDisableNotification(Pwm_ChannelType Channel)
{
    if( !PwmInternal.ChannelEdgeNotification[Channel].Locked ) {
        disableNotification(Channel);
    }
    PwmInternal.ChannelEdgeNotification[Channel].EdgeNotification = (Pwm_EdgeNotificationType)PWM_NO_EDGES;
}
/**
 * Forces disabling of notification and locks the notifications
 * @param Channel
 */
static void forceDisableNotification(Pwm_ChannelType Channel)
{
    if( !PwmInternal.ChannelEdgeNotification[Channel].Locked ) {
        disableNotification(Channel);
        PwmInternal.ChannelEdgeNotification[Channel].Locked = TRUE;
    }
}
/**
 * Enables interrupts for the channel
 * @param Channel
 * @param Notification
 */
static void enableNotification(Pwm_ChannelType Channel, Pwm_EdgeNotificationType Notification)
{

    uint8 enableFlags = 0;

    switch(Notification) {
        case PWM_FALLING_EDGE:
            enableFlags = 1;
            break;
        case PWM_RISING_EDGE:
            enableFlags = 2;
            break;
        case PWM_BOTH_EDGES:
            enableFlags = 3;
            break;
        default:
            return;
    }

    const Pwm_ChannelConfigurationType* channelConfig = &PwmConfigPtr->Channels[Channel];
    volatile struct FLEXPWM_tag *flexHw = GET_FLEXPWM_HW(channelConfig->index);
    uint8 sub = GET_SUBMODULE(channelConfig->index);
    PwmT pwm =  (PwmT)(channelConfig->index % FLEXPWM_SUB_MODULE_DIVIDER);

    switch(pwm) {
    case PWM_A:
        enableFlags <<= 2;
        break;
    case PWM_B:
        enableFlags <<= 4;
        break;
    case PWM_X:
        enableFlags <<= 0;
        break;
    }
    // clear eventual pending notification
    flexHw->SUB[sub].STS.B.CMPF = enableFlags;
    /* Enable flags on this submodule */
    flexHw->SUB[sub].INTEN.B.CMPIE |= enableFlags;

