z2akhtar-zz/PWC-Demonstrator/AUTOSAR/core/arch/ppc/mpc55xx/drivers/PwmFlex.c
}
/**
 * Tries to enable notification for the channel
 * @param Channel
 * @param Notification
 */
static void tryEnableNotification(Pwm_ChannelType Channel, Pwm_EdgeNotificationType Notification)
{
    if( !PwmInternal.ChannelEdgeNotification[Channel].Locked ) {
        enableNotification(Channel, Notification);
    }
    /* Store the requested notification */
    PwmInternal.ChannelEdgeNotification[Channel].EdgeNotification = Notification;
}

/**
 * Restores notifications to the state last requested
 * @param Channel
 */
static void restoreNotification(Pwm_ChannelType Channel)
{
    if(PWM_NO_EDGES != PwmInternal.ChannelEdgeNotification[Channel].EdgeNotification) {
        enableNotification(Channel, PwmInternal.ChannelEdgeNotification[Channel].EdgeNotification);
    }
    PwmInternal.ChannelEdgeNotification[Channel].Locked = FALSE;
}
#endif

#if  (PWM_SET_OUTPUT_TO_IDLE_API == STD_ON) || (PWM_DE_INIT_API==STD_ON)
static void setOutputToIdle(Pwm_ChannelType Channel)
{
    const Pwm_ChannelConfigurationType* channelConfig = &PwmConfigPtr->Channels[Channel];
    /* Use SetDutyCycle to set idle level */
    if(channelConfig->polarity == PwmConfigPtr->IdleState[Channel]) {
        SetDutyCycle(Channel, PWM_100_PERCENT);
    } else {
        SetDutyCycle(Channel, 0);
    }

}
#endif

void Pwm_Init(const Pwm_ConfigType* ConfigPtr) {
    /* @req SWS_Pwm_10002 */
    VALIDATE( ( NULL != ConfigPtr ), PWM_INIT_SERVICE_ID, PWM_E_PARAM_CONFIG );
    VALIDATE( ( PwmInternal.ModuleState == PWM_STATE_UNINITIALIZED ), PWM_INIT_SERVICE_ID, PWM_E_ALREADY_INITIALIZED );

    /** @req SWS_PWM_00118 */
    /** @req SWS_PWM_00121 */
    if( PwmInternal.ModuleState == PWM_STATE_INITIALIZED ) {
#if PWM_DEV_ERROR_DETECT==STD_ON
        Det_ReportError(PWM_MODULE_ID,0,PWM_INIT_SERVICE_ID,PWM_E_ALREADY_INITIALIZED);
#endif
        return;
    }

    PwmConfigPtr = ConfigPtr;
    PwmInternal.ModuleState = PWM_STATE_INITIALIZED;

#if (PWM_NOTIFICATION_SUPPORTED==STD_ON)
    #if defined(NOTIFICATION_ON_CHANNEL_0_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_1_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_2_ENABLED)
    ISR_INSTALL_ISR2("PwmIsr", Pwm_Isr_0_0, (IrqType)(PWM0_COF0),PWM_ISR_PRIORITY, 0);
    #endif
    #if defined(NOTIFICATION_ON_CHANNEL_3_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_4_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_5_ENABLED)
    ISR_INSTALL_ISR2("PwmIsr", Pwm_Isr_0_1, (IrqType)(PWM0_COF1),PWM_ISR_PRIORITY, 0);
    #endif
    #if defined(NOTIFICATION_ON_CHANNEL_6_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_7_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_8_ENABLED)
    ISR_INSTALL_ISR2("PwmIsr", Pwm_Isr_0_2, (IrqType)(PWM0_COF2),PWM_ISR_PRIORITY, 0);
    #endif
    #if defined(NOTIFICATION_ON_CHANNEL_9_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_10_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_11_ENABLED)
    ISR_INSTALL_ISR2("PwmIsr", Pwm_Isr_0_3, (IrqType)(PWM0_COF3),PWM_ISR_PRIORITY, 0);
    #endif
    #if defined(NOTIFICATION_ON_CHANNEL_12_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_13_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_14_ENABLED)
    ISR_INSTALL_ISR2("PwmIsr", Pwm_Isr_1_0, (IrqType)(PWM1_COF0),PWM_ISR_PRIORITY, 0);
    #endif
    #if defined(NOTIFICATION_ON_CHANNEL_15_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_16_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_17_ENABLED)
    ISR_INSTALL_ISR2("PwmIsr", Pwm_Isr_1_1, (IrqType)(PWM1_COF1),PWM_ISR_PRIORITY, 0);
    #endif
    #if defined(NOTIFICATION_ON_CHANNEL_18_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_19_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_20_ENABLED)
    ISR_INSTALL_ISR2("PwmIsr", Pwm_Isr_1_2, (IrqType)(PWM1_COF2),PWM_ISR_PRIORITY, 0);
    #endif
    #if defined(NOTIFICATION_ON_CHANNEL_21_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_22_ENABLED) || defined(NOTIFICATION_ON_CHANNEL_23_ENABLED)
    ISR_INSTALL_ISR2("PwmIsr", Pwm_Isr_1_3, (IrqType)(PWM1_COF3),PWM_ISR_PRIORITY, 0);
    #endif
#endif

    for (Pwm_ChannelType i = 0; i < PWM_NUMBER_OF_CHANNELS; i++) {
#if (PWM_NOTIFICATION_SUPPORTED==STD_ON)
        PwmInternal.ChannelEdgeNotification[i].EdgeNotification = (Pwm_EdgeNotificationType)PWM_NO_EDGES;
        PwmInternal.ChannelEdgeNotification[i].Locked = FALSE;
#endif
        configureChannel( i );
    }

}

#if (PWM_DE_INIT_API==STD_ON)

static void Pwm_DeInitChannel(Pwm_ChannelType Channel) {

    setOutputToIdle(Channel);

    /*
     * PWM052: The function Pwm_DeInit shall disable all notifications.
     */
#if (PWM_NOTIFICATION_SUPPORTED==STD_ON)
    /* Try to enable notification. They have been forced disabled
     * by setOutputToIdle since it sets duty cycle to 0 or 100%. */
    tryDisableNotification(Channel);
#endif

}

void Pwm_DeInit(void) {

    VALIDATE(PwmInternal.ModuleState == PWM_STATE_INITIALIZED, PWM_DEINIT_SERVICE_ID, PWM_E_UNINIT);

    for (Pwm_ChannelType i = 0; i < PWM_NUMBER_OF_CHANNELS; i++) {
        const Pwm_ChannelConfigurationType* channelConfig = &PwmConfigPtr->Channels[i];
        volatile struct FLEXPWM_tag *flexHw = GET_FLEXPWM_HW(channelConfig->index);
        uint8 sub = GET_SUBMODULE(channelConfig->index);
        PwmT pwm =  (PwmT)(channelConfig->index % FLEXPWM_SUB_MODULE_DIVIDER);
        Pwm_DeInitChannel(i);
        // disable output
        switch(pwm)
        {
        case PWM_A: /* PWMA */
            flexHw->OUTEN.B.PWMA_EN &= ~(1 << sub);
            break;
        case PWM_B: /* PWMB */
            flexHw->OUTEN.B.PWMB_EN &= ~(1 << sub);
            break;
        case PWM_X: /* PWMX */
            flexHw->OUTEN.B.PWMX_EN &= ~(1 << sub);
            break;
        }
    }
    // Disable module
	for (Pwm_ChannelType i = 0; i < PWM_NUMBER_OF_CHANNELS; i++) {
        const Pwm_ChannelConfigurationType* channelConfig = &PwmConfigPtr->Channels[i];
        volatile struct FLEXPWM_tag *flexHw = GET_FLEXPWM_HW(channelConfig->index);
        uint8 sub = GET_SUBMODULE(channelConfig->index);
        flexHw->MCTRL.B.CLDOK = (1 << sub);
        flexHw->MCTRL.B.RUN &= ~(1 << sub);
	}


	PwmInternal.ModuleState = PWM_STATE_UNINITIALIZED;
}
#endif


