z2akhtar-zz/PWC-Demonstrator/AUTOSAR/core/arch/ppc/mpc55xx/drivers/PwmFlex.c
/*
 * PWM083: The function Pwm_SetPeriodAndDuty shall be pre compile time
 * changeable ON/OFF by the configuration parameter PwmSetPeriodAndDuty.
 */
#if (PWM_SET_PERIOD_AND_DUTY_API==STD_ON)
void Pwm_SetPeriodAndDuty(Pwm_ChannelType Channel, Pwm_PeriodType Period, uint16 DutyCycle) {

    VALIDATE(PwmInternal.ModuleState == PWM_STATE_INITIALIZED, PWM_SETPERIODANDDUTY_SERVICE_ID, PWM_E_UNINIT);
    VALIDATE(Channel < PWM_NUMBER_OF_CHANNELS, PWM_SETPERIODANDDUTY_SERVICE_ID, PWM_E_PARAM_CHANNEL);

    if(PwmConfigPtr->ChannelClass[Channel] != PWM_VARIABLE_PERIOD){
#if PWM_DEV_ERROR_DETECT==STD_ON
        Det_ReportError(PWM_MODULE_ID,0, PWM_SETPERIODANDDUTY_SERVICE_ID, PWM_E_PERIOD_UNCHANGEABLE);
#endif
        return;
    }

    const Pwm_ChannelConfigurationType* channelConfig = &PwmConfigPtr->Channels[Channel];
    volatile struct FLEXPWM_tag *flexHw = GET_FLEXPWM_HW(channelConfig->index);
    uint8 sub = GET_SUBMODULE(channelConfig->index);
    if(flexHw->SUB[sub].VAL[1].R != Period) { // only tests period 1 since all periods must be the same
        // clear eventual ldok flag
        flexHw->MCTRL.B.CLDOK = 1 << sub;
        flexHw->SUB[sub].VAL[1].R = Period;
        // set ldok to ensure that new values are used at next reload
        flexHw->MCTRL.B.LDOK = 1 << sub;
    }

    SetDutyCycle(Channel, DutyCycle);
}
#endif

static void SetDutyCycle(Pwm_ChannelType Channel, uint16 DutyCycle)
{
    const Pwm_ChannelConfigurationType* channelConfig = &PwmConfigPtr->Channels[Channel];
    volatile struct FLEXPWM_tag *flexHw = GET_FLEXPWM_HW(channelConfig->index);
    uint8 sub = GET_SUBMODULE(channelConfig->index);
    PwmT pwm =  (PwmT)(channelConfig->index % FLEXPWM_SUB_MODULE_DIVIDER);

    uint16 leading_edge_position;

    /* Timer instant for leading edge */

    /*
     * PWM017: The function Pwm_SetDutyCycle shall update the duty cycle at
     * the end of the period if supported by the implementation and configured
     * with PwmDutycycleUpdatedEndperiod. [ This is achieved in hardware since
     * the A and B registers are double buffered ]
     *
     * PWM014: The function Pwm_SetDutyCycle shall set the output state according
     * to the configured polarity parameter [which is already set from
     * Pwm_Init], when the duty parameter is 0% [=0] or 100% [=0x8000].
     */

    leading_edge_position = (uint16) ((flexHw->SUB[sub].VAL[PwmRegIndex[pwm].periodRegIndex].R
                * (uint32) DutyCycle) / PWM_100_PERCENT );
    // clear eventual ldok flag
    flexHw->MCTRL.B.CLDOK = 1 << sub;
    if( PWM_100_PERCENT == DutyCycle ) {
        /* Increment to one above period to never get match on turn off (prevents glitch).
         * This may lead to  */
        leading_edge_position++;
    }
    if( PWM_X == pwm ) {
        /* Cannot get 0% duty cycle (according to reference manual you
         * can't get 100% on PWMX but we invert it so it).
         * But we can get 100% percent duty cycle so invert polarity
         * and set the duty cycle to 100%  */
        if( PWM_0_PERCENT == DutyCycle ) {
            flexHw->SUB[sub].OCTRL.B.POLX = (channelConfig->polarity == PWM_LOW) ? 1 : 0;
            leading_edge_position = flexHw->SUB[sub].VAL[PwmRegIndex[pwm].periodRegIndex].R + 1;
        } else {
            /* Restore the polarity */
            flexHw->SUB[sub].OCTRL.B.POLX = (channelConfig->polarity == PWM_LOW) ? 0 : 1;
        }
    }
    flexHw->SUB[sub].VAL[PwmRegIndex[pwm].dutyRegIndex].R = leading_edge_position;
#if (PWM_NOTIFICATION_SUPPORTED==STD_ON)
    if( (PWM_100_PERCENT == DutyCycle) || (PWM_0_PERCENT == DutyCycle)) {
        /* Will not give edges so disable the notification */
        forceDisableNotification(Channel);
    } else {
        /* Restore the notification as requested */
        restoreNotification(Channel);
    }
#endif
    // set ldok to ensure that new values are used at next reload
    flexHw->MCTRL.B.LDOK = 1 << sub;

}


/**
 * PWM013: The function Pwm_SetDutyCycle shall set the duty cycle of the PWM
 * channel.
 *
 * @param Channel PWM channel to use. 0 <= Channel < PWM_NUMBER_OF_CHANNELS <= 16
 * @param DutyCycle 0 <= DutyCycle <= 0x8000
 */
#if (PWM_SET_DUTY_CYCLE_API==STD_ON)
void Pwm_SetDutyCycle(Pwm_ChannelType Channel, uint16 DutyCycle)
{
    VALIDATE(PwmInternal.ModuleState == PWM_STATE_INITIALIZED, PWM_SETDUTYCYCLE_SERVICE_ID, PWM_E_UNINIT);
    VALIDATE(Channel < PWM_NUMBER_OF_CHANNELS, PWM_SETDUTYCYCLE_SERVICE_ID, PWM_E_PARAM_CHANNEL);

	SetDutyCycle(Channel, DutyCycle);
}
#endif

#if  (PWM_SET_OUTPUT_TO_IDLE_API == STD_ON)
/* @req SWS_Pwm_10084 */
/* @req SWS_Pwm_20084 */
void Pwm_SetOutputToIdle(Pwm_ChannelType Channel)
{
    VALIDATE(PwmInternal.ModuleState == PWM_STATE_INITIALIZED, PWM_SETOUTPUTTOIDLE_SERVICE_ID, PWM_E_UNINIT);
    VALIDATE(Channel < PWM_NUMBER_OF_CHANNELS, PWM_SETOUTPUTTOIDLE_SERVICE_ID, PWM_E_PARAM_CHANNEL);
    /* @req SWS_Pwm_10021 */
    setOutputToIdle(Channel);
}
#endif
/*
 * PWM085: The function Pwm_GetOutputState shall be pre compile configurable
 * ON/OFF by the configuration parameter PwmGetOutputState
 */
#if (PWM_GET_OUTPUT_STATE_API==STD_ON)
/*
 * PWM022: The function Pwm_GetOutputState shall read the internal state
 * of the PWM output signal and return it.
 */
Pwm_OutputStateType Pwm_GetOutputState(Pwm_ChannelType Channel)
{
    Pwm_OutputStateType res = PWM_LOW;

    VALIDATE_W_RV(PwmInternal.ModuleState == PWM_STATE_INITIALIZED, PWM_GETOUTPUTSTATE_SERVICE_ID, PWM_E_UNINIT, res);
    VALIDATE_W_RV(Channel < PWM_NUMBER_OF_CHANNELS, PWM_GETOUTPUTSTATE_SERVICE_ID, PWM_E_PARAM_CHANNEL, res);

    const Pwm_ChannelConfigurationType* channelConfig = &PwmConfigPtr->Channels[Channel];
    volatile struct FLEXPWM_tag *flexHw = GET_FLEXPWM_HW(channelConfig->index);
    uint8 sub = GET_SUBMODULE(channelConfig->index);
    PwmT pwm =  (PwmT)(channelConfig->index % FLEXPWM_SUB_MODULE_DIVIDER);

    switch(pwm)
    {
    case PWM_A:
        res = PWM_LOW;
        // not supported on this channel
        //res = (Pwm_OutputStateType)flexHw->SUB[sub].OCTRL.B.PWMA_IN;
        break;
    case PWM_B:
        res = PWM_LOW;
        // not supported on this channel
        //res = (Pwm_OutputStateType)flexHw->SUB[sub].OCTRL.B.PWMB_IN;
        break;
    case PWM_X:
        res = (Pwm_OutputStateType)flexHw->SUB[sub].OCTRL.B.PWMX_IN;
        break;
    default:
        break;
    }

    return res;
}
#endif

#if (PWM_NOTIFICATION_SUPPORTED==STD_ON)
void Pwm_DisableNotification(Pwm_ChannelType Channel)
{
    VALIDATE(PwmInternal.ModuleState == PWM_STATE_INITIALIZED, PWM_DISABLENOTIFICATION_SERVICE_ID, PWM_E_UNINIT);
    VALIDATE(Channel < PWM_NUMBER_OF_CHANNELS, PWM_DISABLENOTIFICATION_SERVICE_ID, PWM_E_PARAM_CHANNEL);
    /* Try to disable the notification. It may already be
     * disabled due to duty cycle 0% and 100%. */
    tryDisableNotification(Channel);
}

void Pwm_EnableNotification(Pwm_ChannelType Channel, Pwm_EdgeNotificationType Notification)
{
    VALIDATE(PwmInternal.ModuleState == PWM_STATE_INITIALIZED, PWM_ENABLENOTIFICATION_SERVICE_ID, PWM_E_UNINIT);
    VALIDATE(Channel < PWM_NUMBER_OF_CHANNELS, PWM_ENABLENOTIFICATION_SERVICE_ID, PWM_E_PARAM_CHANNEL);
    /* Try to enable the notification. It may be disabled due to
     * duty cycle 0% and 100%. In this case the notifications will be
     * enbled laster when changing duty cycle to other than 0% or 100% */
    tryEnableNotification(Channel, Notification);
}

static void Pwm_Isr(uint8 hwUnit, uint8 sub)
{
    volatile struct FLEXPWM_tag *flexHw = GET_HW_PTR(hwUnit);
    uint8 cmpflags = flexHw->SUB[sub].STS.B.CMPF & flexHw->SUB[sub].INTEN.B.CMPIE;

    uint8 isr = 0;
    for(PwmT pwm = (PwmT)0; pwm < FLEXPWM_SUB_MODULE_DIVIDER; pwm++) {
        isr = 0;
        switch(pwm) {
        case PWM_A:
            isr = (0x3 << 2) & cmpflags;
            break;
        case PWM_B:
            isr = (0x3 << 4) & cmpflags;
            break;
        case PWM_X:
            isr = (0x3 << 0) & cmpflags;
            break;
        }
        if ( isr ) {
            /* Flag set and the channel output. Find the corresponding channel.
             * IMPROVEMENT: Generate mapping from channel to config index to
             * avoid looping. */
            Pwm_ChannelType channel = GET_SUB_START_CHANNEL(hwUnit, sub) + pwm;
            for (Pwm_ChannelType i = 0; i < PWM_NUMBER_OF_CHANNELS; i++) {
                if( channel == PwmConfigPtr->Channels[i].index ) {
                    if( NULL != PwmConfigPtr->NotificationHandlers[i] ) {
                        PwmConfigPtr->NotificationHandlers[i]();
                    }
                    break;
                }
            }

        }
        // Clear interrupt
        flexHw->SUB[sub].STS.B.CMPF = isr;
    }
}
#endif /* PWM_NOTIFICATION_SUPPORED == STD_ON */

#if ( PWM_VERSION_INFO_API == STD_ON)
void Pwm_GetVersionInfo( Std_VersionInfoType* versioninfo) {

    /* @req SWS_Pwm_00151 */
    VALIDATE( ( NULL != versioninfo ), PWM_GETVERSIONINFO_SERVICE_ID, PWM_E_PARAM_POINTER);

    versioninfo->vendorID = PWM_VENDOR_ID;
    versioninfo->moduleID = PWM_MODULE_ID;
    versioninfo->sw_major_version = PWM_SW_MAJOR_VERSION;
    versioninfo->sw_minor_version = PWM_SW_MINOR_VERSION;
    versioninfo->sw_patch_version = PWM_SW_PATCH_VERSION;

}
#endif

